configuration/src/Documents/ВнутреннееЗадание/ВнутреннееЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннееЗадание</name>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Document.ВнутреннееЗадание</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначена</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <comment>Ссылка на другой объект БД, которому подчинен текущий объект</comment>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок задачи в общей очереди</comment>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <comment>Процент выполнения с шагом 10</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаУчета</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <comment>Служит для передачи значения от проекта к заявке. Не зависит от выбранного направления. Не отображается на форме</comment>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

configuration/src/InformationRegisters/ИспользованиеЮридическихЛицНаправлений/ИспользованиеЮридическихЛицНаправлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользованиеЮридическихЛицНаправлений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СвойстваВнутреннихЗаданий/СвойстваВнутреннихЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваВнутреннихЗаданий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ПриостановленныеЗадачи/ПриостановленныеЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПриостановленныеЗадачи</name>
  <comment>Статистика приостановки задач</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <comment>Дата, с которой статус &quot;Приостановлена&quot; был изменен на любой другой</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>DocumentRef.Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/Комментарии/Комментарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Комментарии</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <comment>Текст комментария в HTML</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <comment>Автор комментария</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Важный</name>
    <comment>Комментарий является важным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата и время последнего изменения комментария</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторJira</name>
    <comment>Используется для хранения идентификатора комментария из Jira</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Общедоступный</name>
    <comment>Истина - комментарий виден всем, Ложь - виден только группе разработки автора комментария</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаJira</name>
    <comment>Используется для хранения почты автора комментария из Jira</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <comment>Комментарий является служебным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект-владелец комментария</comment>
    <type>
      <types>DefinedType.ИсточникКомментариев</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомментария</name>
    <comment>Идентификатор комментария</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ПричиныИзмененияСтатусаОбъектов/ПричиныИзмененияСтатусаОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПричиныИзмененияСтатусаОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>CatalogRef.ПричиныИзмененияСтатусов</types>
    </type>
  </attributes>
  <attributes>
    <name>Система</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПричины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ИсторияИзмененийЮрЛицОбъектов/ИсторияИзмененийЮрЛицОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененийЮрЛицОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ОбъектыВерхнегоУровняСтруктурыПодчиненности/ОбъектыВерхнегоУровняСтруктурыПодчиненности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыВерхнегоУровняСтруктурыПодчиненности</name>
  <comment>Используется при открытии структуры подчиненности, для получения высшего родителя объекта.</comment>
  <resources>
    <name>ВысшийРодитель</name>
    <type>
      <types>DefinedType.ОбъектНаблюдения</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СтруктураПодчиненности/СтруктураПодчиненности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтруктураПодчиненности</name>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектСтруктурыПодчиненности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Родитель</name>
    <type>
      <types>DefinedType.ОбъектСтруктурыПодчиненности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ЗаинтересованныеЛица/ЗаинтересованныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаинтересованныеЛица</name>
  <resources>
    <name>ОтношениеКПроекту</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Роль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Подписчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Documents/ВнутреннееЗадание/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбъявлениеПеременных

// Хранит состояние объекта до записи
Перем ДанныеДоЗаписи;

// Хранит признак изменения описания
Перем ОписаниеИзменилось;

// Хранит признак, что у объекта изменился объект-основание
Перем ИзменилосьОснование;

// Признак, что изменился статус
Перем ИзменилсяСтатус;

// Признак, что изменился филиал
Перем ИзменилсяФилиал;

// Хранит описание изменений объекта
Перем ОписаниеИзменений;

// Хранит признак, указывающий, что объект еще не записан в БД
Перем ЭтоНовыйОбъект;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Направление) 
		И РегистрыСведений.ИспользованиеЮридическихЛицНаправлений.Использует(Направление) Тогда

		ПроверяемыеРеквизиты.Добавить("ЮридическоеЛицо");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// ДЕЙСТВИЯ, СВЯЗАННЫЕ С ОБРАЩЕНИЕМ К "СТАРЫМ" ЗНАЧЕНИЯМ РЕКВИЗИТОВ ОБЪЕКТА
	
	// Данные объекта до записи
	ДанныеДоЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, 
		"Автор, Заказчик, Назначена, ОбъектОснование, Описание, Проект, Статус, Направление, ЮридическоеЛицо, Филиал, ВидРодительскогоПроекта");
	
	// Определенные данные объекта до записи,
	// для фиксации изменений состояния в РС.ОчередьСобытийНаОбработку 
	ОписаниеИзменений = ОбщегоНазначения.ПолучитьСостояниеОбъектаДоЗаписи(Ссылка);
	
	Если ДополнительныеСвойства.Свойство("ОценкаТрудозатрат") Тогда
		ОписаниеИзменений.Значения.Реквизиты.Вставить("ОценкаТрудозатрат", ДополнительныеСвойства.ОценкаТрудозатрат);
	КонецЕсли;
	
	// ДЕЙСТВИЯ, СВЯЗАННЫЕ С ПРОВЕРКАМИ И ЗАПОЛНЕНИЕМ ЗНАЧЕНИЙ РЕКВИЗИТОВ ОБЪЕКТА
	
	// Плановые трудозатраты
	ПредыдущаяОценкаТрудозатрат = УчетТрудозатрат.ПолучитьПлановыеТрудозатраты(Ссылка);
	
	Если ДополнительныеСвойства.Свойство("ОценкаТрудозатрат") 
		И ДополнительныеСвойства.ОценкаТрудозатрат <> ПредыдущаяОценкаТрудозатрат Тогда
		
		ДополнительныеСвойства.Вставить("ИзмениласьОценкаТрудозатрат");
	КонецЕсли;
		
	ТекущаяДата = ТекущаяДатаСеанса();
	ЭтоНовыйОбъект = ЭтоНовый();
	
	НовыйСтатус = Неопределено;
	Если ДополнительныеСвойства.Свойство("НовыйСтатус", НовыйСтатус) = Ложь Тогда
		НовыйСтатус = Статус;
	КонецЕсли;	
		
	ИзменилсяСтатус = (ДанныеДоЗаписи.Статус <> НовыйСтатус);
	ИзменилсяФилиал = (Филиал <> ДанныеДоЗаписи.Филиал);
	
	Если ДополнительныеСвойства.Свойство("НовыйСтатус") Тогда
		Статус = ДополнительныеСвойства.НовыйСтатус;
	КонецЕсли;
	
	Если ЭтоНовыйОбъект Тогда
		Если НЕ ЗначениеЗаполнено(Статус) Тогда
			Статус = Справочники.СтатусыОбъектов.Новый;
		КонецЕсли;
		
		ЭтотОбъект.УстановитьНовыйНомер();
		КороткийНомер = ОбщегоНазначения.ПолучитьКороткийНомер(Номер, Документы.ВнутреннееЗадание.ПолучитьПрефикс());
	    ДатаИзмененияСтатуса = Дата;
	Иначе
		Если Статус <> Справочники.СтатусыОбъектов.Новый И Статус <> Справочники.СтатусыОбъектов.Приостановлен
			И НЕ ЗначениеЗаполнено(Филиал) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Филиал"" не заполнено.", , "Объект.Филиал", , Отказ);
			Возврат;
		КонецЕсли;
		
		Если ИзменилсяСтатус Тогда
			ДатаИзмененияСтатуса = ТекущаяДата;
			ОбработатьИзменениеСтатуса();
		КонецЕсли;
		
		Если Статус = Справочники.СтатусыОбъектов.Решен Тогда
			ПроцентВыполнения = 100;
		Иначе
			ПорядокСтатуса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Статус, "Порядок");
			Если ПроцентВыполнения > 0 И ПроцентВыполнения < 100 Тогда
				Если ПорядокСтатуса < ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.СтатусыОбъектов.ВРаботе, "Порядок") Тогда
					Статус = Справочники.СтатусыОбъектов.ВРаботе;
				КонецЕсли;
			ИначеЕсли ПроцентВыполнения = 100 Тогда
				Статус = Справочники.СтатусыОбъектов.Решен;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИзменилсяСтатус ИЛИ Назначена <> ДанныеДоЗаписи.Назначена Тогда
		ДополнительныеСвойства.Вставить("ЗаписатьИзмененияСвойствЗадачи", Истина);
	КонецЕсли;
		
	ИзменилосьОснование = (ОбъектОснование <> ДанныеДоЗаписи.ОбъектОснование) ИЛИ (Проект <> ДанныеДоЗаписи.Проект);
	Если ИзменилосьОснование Тогда
		Если ЗначениеЗаполнено(ОбъектОснование) Тогда
			ВидРодительскогоПроекта = ОбщегоНазначения.ПолучитьВидРодительскогоПроекта(ОбъектОснование);
		Иначе
			ВидРодительскогоПроекта = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	// Если объект изменен записываем дату изменения, и дату изменения в объект верхнего уровня
	Если ДополнительныеСвойства.Свойство("ОбновитьДатыПоследнихИзменений") Тогда
		ДатаПоследнегоИзменения = ТекущаяДата;
	КонецЕсли;
	
	Если Назначение = Справочники.НазначенияЗадач.Ошибка И НЕ ЗначениеЗаполнено(СерьезностьОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Серьезность ошибки"" не заполнено", , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ЕстьИзмененияОписания = Неопределено;	
	Если ДополнительныеСвойства.Свойство("ОписаниеИзменилось") Тогда
		ЕстьИзмененияОписания = ДополнительныеСвойства.ОписаниеИзменилось;
	КонецЕсли;
	
	// Задействование механизма сравнения истории описания объектов
	ОписаниеИзменилось = ИсторияИзменений.СравнитьОписанияОбъектаПриЗаписи(Ссылка, 
		ДанныеДоЗаписи.Описание, Описание, ЕстьИзмененияОписания);
		
	Если НЕ Отказ И (ОписаниеИзменилось ИЛИ ЭтоНовыйОбъект) Тогда
		ИндексируемоеОписание = РедакторОписания.ПолучитьИндексируемоеОписание(Описание);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Сравнение состояния до и после записи
	Если ДополнительныеСвойства.Свойство("Комментарий") Тогда
		ОбщегоНазначения.ОбработатьИзменениеОбъекта(Ссылка, ОписаниеИзменений, , ДополнительныеСвойства.Комментарий);
	Иначе
		ОбщегоНазначения.ОбработатьИзменениеОбъекта(Ссылка, ОписаниеИзменений);
	КонецЕсли;
		
	// Сохранение ключевых свойств задачи
	Если ДополнительныеСвойства.Свойство("ЗаписатьИзмененияСвойствЗадачи") Тогда
		РегистрыСведений.СвойстваВнутреннихЗаданий.Добавить(Ссылка, Назначена, Статус, Порядок);
	КонецЕсли;
	
	// Проверка изменения статуса задачи
	ПараметрыОперации = Неопределено;
	Если ДополнительныеСвойства.Свойство("ПроверкаИзмененияСтатусаПередЗаписью", ПараметрыОперации) Тогда
		ТекстКомментария = ПараметрыОперации.Комментарий.ТекстКомментария;
		Общедоступный = ПараметрыОперации.Комментарий.Общедоступный;
		Служебный = ?(Статус = Справочники.СтатусыОбъектов.Отклонен, Истина, Ложь);
		
		Если ПараметрыОперации.ВидОперации = Справочники.СтатусыОбъектов.Приостановлен Тогда
			РегистрыСведений.ПриостановленныеЗадачи.Приостановить(Ссылка, ТекстКомментария);
			Служебный = Истина;
		Иначе
			// Если есть незакрытый период приостановки задачи, необходимо его закрыть
			Если ПараметрыОперации["ЕстьНезакрытыйПериодПриостановки"] = Истина Тогда
				РегистрыСведений.ПриостановленныеЗадачи.Возобновить(Ссылка);
				Комментарий = "<p>Работа над задачей возобновлена.</p>";
				Служебный = Истина;
				
				Если НЕ ПустаяСтрока(ТекстКомментария) Тогда
					ТекстКомментария = Комментарий + Символы.ПС + ТекстКомментария;
				Иначе
					ТекстКомментария = Комментарий;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстКомментария) Тогда
			ИдентификаторКомментария = ПараметрыОперации.Комментарий.Идентификатор;
			РегистрыСведений.Комментарии.Добавить(Ссылка, ИдентификаторКомментария, , ТекстКомментария, , Служебный, Общедоступный);
			
			Если ПараметрыОперации.Свойство("ПричинаИзмененияСтатуса") Тогда
				РегистрыСведений.ПричиныИзмененияСтатусаОбъектов.Добавить(Ссылка, Статус, ПараметрыОперации.ПричинаИзмененияСтатуса, ИдентификаторКомментария);
				ТребуетсяУведомлениеОбИзмененииСтатуса = ПараметрыОперации.НеобходимоОтправитьУведомление;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыОперации.Свойство("Трудозатраты") Тогда
			Трудозатраты = ПараметрыОперации.Трудозатраты;
			
			Если Трудозатраты.ЗатратыВремени > 0 И ЗначениеЗаполнено(Трудозатраты.ВидДеятельности) Тогда
				ДанныеЗаполнения = Документы.Трудозатраты.НовыеПараметрыЗаполненияТрудозатрат();
				ДанныеЗаполнения.Дата = ОбщегоНазначения.ТекущаяДатаСоСдвигом();
				ДанныеЗаполнения.Объект = Ссылка;
				ДанныеЗаполнения.Затрата = Трудозатраты.ЗатратыВремени;
				ДанныеЗаполнения.ВидДеятельности = Трудозатраты.ВидДеятельности;
				ДанныеЗаполнения.Пользователь = ПараметрыСеанса.ТекущийПользователь;
				ДанныеЗаполнения.Комментарий = Трудозатраты.Комментарий;
				ДанныеЗаполнения.Услуга = Трудозатраты.Услуга;
				ДанныеЗаполнения.Автор = ПараметрыСеанса.ТекущийПользователь;
				ДанныеЗаполнения.Направление = Направление;
				
				Документы.Трудозатраты.ДобавитьТрудозатраты(ДанныеЗаполнения);
			КонецЕсли;
		КонецЕсли;
		
		ДополнительныеСвойства.Удалить("ПроверкаИзмененияСтатусаПередЗаписью");
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если ДанныеДоЗаписи.ЮридическоеЛицо <> ЮридическоеЛицо Тогда
		РегистрыСведений.ИсторияИзмененийЮрЛицОбъектов.ДобавитьЗапись(Ссылка, ЮридическоеЛицо, ТекущаяДата);
	КонецЕсли;
	
	// Запись в регистр сведений высшего родителя для текущего объекта
	Если ЭтоНовыйОбъект ИЛИ ИзменилосьОснование Тогда
		Если НЕ ЗначениеЗаполнено(ОбъектОснование) Тогда
			ОбъектОснование = Неопределено;
		КонецЕсли;
		
		РегистрыСведений.ОбъектыВерхнегоУровняСтруктурыПодчиненности.Добавить(Ссылка, ОбъектОснование);
		РегистрыСведений.СтруктураПодчиненности.Добавить(Ссылка, ОбъектОснование, ДанныеДоЗаписи.ОбъектОснование);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ОбновитьДатыПоследнихИзменений") Тогда
		ОбщегоНазначения.ДобавитьДатыИзмененияДляПроекта(Ссылка);
		ДополнительныеСвойства.Удалить("ОбновитьДатыПоследнихИзменений");
	КонецЕсли;
	
	// Если это новый объект, то нужно добавить заказчика в заинтересованные лица и протянуть наблюдателей
	Если ЭтоНовыйОбъект Тогда
		УчастникиПроцессов.ДобавитьУчастниковИзОбъектаОснования(Ссылка);
		
		РегистрыСведений.ЗаинтересованныеЛица.ДобавитьЗапись(Ссылка, Заказчик, "Заказчик");
	КонецЕсли;
	
	Если ДанныеДоЗаписи.Статус <> Статус Тогда
		// Если является документом для элемента проекта и изменился статус, необходимо изменить статус элемента проекта
		РегистрыСведений.ПланыВыполненияПроектов.ИзменитьСтатусЭлементаПланаПроекта(Ссылка, Статус, ДатаЗакрытия, ПроцентВыполнения);
		
		// Если есть активный спринт, обновить статус в истории спринта
		Спринт = РегистрыСведений.СоставСпринтов.ПолучитьАктивныеСпринтыОбъекта(Ссылка);
		
		Если ЗначениеЗаполнено(Спринт) Тогда
			РегистрыСведений.ИсторияСоставаСпринтов.Добавить(Ссылка, Спринт, Статус);
		КонецЕсли;
	КонецЕсли;
	
	УчастникиПроцессов.ОбновитьУчастниковОбъекта(Ссылка, ДанныеДоЗаписи);
	
	ИнтеграцияДополнительныхПодсистем.ДобавитьИсключаемыеОбъекты(Ссылка, ОбъектОснование);
	
	УчетТрудозатрат.ПроверкаНеобходимостиПересчетаТрудозатрат(ЭтотОбъект, ЭтоНовыйОбъект, ДанныеДоЗаписи);
	
	Если ЗначениеЗаполнено(ОбъектОснование) И ОбъектОснование <> ДанныеДоЗаписи.ОбъектОснование Тогда
		ДополнительныеСвойства.Вставить("ЕстьИзмененияДляОбъектаОснования");
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ИзмениласьОценкаТрудозатрат") Тогда			
		УчетТрудозатрат.ЗаписатьПлановыеТрудозатраты(Ссылка, ДополнительныеСвойства.ОценкаТрудозатрат);
	КонецЕсли;
	
	Если ЭтоНовыйОбъект ИЛИ ИзменилсяСтатус ИЛИ ИзменилсяФилиал Тогда
		РегистрыСведений.ОчередьСобытийНаОбработку.ДобавитьЗаданиеОбработатьОбъектЭтапаКанбана(Ссылка);
	КонецЕсли;
	
	// Если изменился вид родительского проекта, нужно обновить его и у подчиненных объектов
	Если НЕ ЭтоНовыйОбъект И (ВидРодительскогоПроекта <> ДанныеДоЗаписи.ВидРодительскогоПроекта) Тогда 
		РегистрыСведений.ОчередьСобытийНаОбработку.ДобавитьЗаданиеОбновитьВидРодительскогоПроекта(Ссылка, ВидРодительскогоПроекта);
	КонецЕсли;
	
	// Если изменили основание объекта, то нужно перебросить общие фактические трудозатраты со старого основания на новое
	Если НЕ ЭтоНовыйОбъект И (ОбъектОснование <> ДанныеДоЗаписи.ОбъектОснование) Тогда
		УчетТрудозатрат.ОбработатьТрудозатратыПриИзмененииОснованияОбъекта(Ссылка, ОбъектОснование, ДанныеДоЗаписи.ОбъектОснование);
	КонецЕсли;
	
	Если НЕ Отказ И (ОписаниеИзменилось ИЛИ ЭтоНовыйОбъект) Тогда    
		РедакторОписания.ДополнительноОбработатьОписание(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Справочники.СерьезностьОшибок.ПриКопированииОбъекта(СерьезностьОшибки, Назначение);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипЗначенияДанных = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначенияДанных = Тип("СправочникСсылка.Проекты") Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
			"Автор, ВидПроекта, ВидПроцесса, Направление, ЮридическоеЛицо");
		
		Проект = ДанныеЗаполнения;
		ОбъектОснование = ДанныеЗаполнения;
		Заказчик = ЗначенияРеквизитов.Автор;
		ВидРодительскогоПроекта = ЗначенияРеквизитов.ВидПроекта;
		ВидПроцесса = ЗначенияРеквизитов.ВидПроцесса;
		Направление = ЗначенияРеквизитов.Направление;
		ЮридическоеЛицо = ЗначенияРеквизитов.ЮридическоеЛицо;
		
	ИначеЕсли ТипЗначенияДанных = Тип("ДокументСсылка.ВнутреннееЗадание") Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
			"Проект, Направление, Автор, ВидРодительскогоПроекта, Наименование, Назначение,
			|СерьезностьОшибки, ВидПроцесса, ЮридическоеЛицо");
		
		ОбъектОснование = ДанныеЗаполнения;
		Проект = ЗначенияРеквизитов.Проект;
		Направление = ЗначенияРеквизитов.Направление;
		Заказчик = ЗначенияРеквизитов.Автор;
		ВидРодительскогоПроекта = ЗначенияРеквизитов.ВидРодительскогоПроекта;
		Наименование = ЗначенияРеквизитов.Наименование;
		Назначение = ЗначенияРеквизитов.Назначение;
		СерьезностьОшибки = ЗначенияРеквизитов.СерьезностьОшибки;
		ВидПроцесса = ЗначенияРеквизитов.ВидПроцесса;
		ЮридическоеЛицо = ЗначенияРеквизитов.ЮридическоеЛицо;
		
	ИначеЕсли ТипЗначенияДанных = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	УстановитьЗначенияИзНастроекЗаполненияПользователя();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьИзменениеСтатуса()
		
	// Хранит имена реквизитов, которые необходимо заполнить текущей датой
	ЗаполняемыеРеквизиты = Новый Массив;
	
	НеобработанныйСтатус = Ложь;
	ТекущаяДата = ТекущаяДатаСеанса();
	Статусы = Справочники.СтатусыОбъектов;

	Если Статус = Статусы.ВРаботе Тогда
		ЗаполняемыеРеквизиты.Добавить("ДатаНачалаРазработки");
		
	ИначеЕсли Статус = Статусы.Тестирование Тогда
		ЗаполняемыеРеквизиты.Добавить("ДатаПоследнегоТестирования");
		
	ИначеЕсли Статус = Статусы.Решен Тогда
		ЗаполняемыеРеквизиты.Добавить("ДатаНачалаРазработки");
		ЗаполняемыеРеквизиты.Добавить("ДатаПоследнегоТестирования");
		ЗаполняемыеРеквизиты.Добавить("ДатаЗакрытия");
		
		ПроцентВыполнения = 100;
		
	ИначеЕсли Статус = Статусы.Отклонен Тогда
		ЗаполняемыеРеквизиты.Добавить("ДатаЗакрытия");
	КонецЕсли;
	
	// Если дата, соответствующая статусу, не заполнена, она заполняется текущей датой.
	// При переводе в статус "Тестирование" дата последнего тестирования обновляется всегда.
	Для Каждого ИмяРеквизита Из ЗаполняемыеРеквизиты Цикл
		Если ЗначениеЗаполнено(ИмяРеквизита)
			И (НЕ ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]) ИЛИ Статус = Статусы.Тестирование) Тогда
			
			ЭтотОбъект[ИмяРеквизита] = ТекущаяДата;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Назначена) Тогда
		Назначена = Документы.ВнутреннееЗадание.ПолучитьНазначеного(Статус, Ссылка,	Направление, Заказчик, Назначена); 
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗначенияИзНастроекЗаполненияПользователя()

	ВидыНастроек = ПланыВидовХарактеристик.ВидыНастроекПользователя;
	НастройкиАвтозаполнения = РаботаСНастройками.ПолучитьНастройкиАвтозаполнения(ВидыНастроек.ЗаполнениеВнутреннегоЗадания);
	
	Если НЕ ЗначениеЗаполнено(Направление) Тогда
		Направление = НастройкиАвтозаполнения[ВидыНастроек.НаправлениеДляЗаполненияВЗ];
	КонецЕсли;
	
	Если Направление = НастройкиАвтозаполнения[ВидыНастроек.НаправлениеДляЗаполненияВЗ] Тогда
		
		Если РегистрыСведений.ИспользованиеЮридическихЛицНаправлений.Использует(Направление) Тогда
			ЮридическоеЛицо = НастройкиАвтозаполнения[ВидыНастроек.ЮрЛицоДляЗаполненияВЗ];
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидПроцесса) 
			И Справочники.НаправленияРазработки.ИспользуетВидыПроцессов(Направление) Тогда
			ВидПроцесса = НастройкиАвтозаполнения[ВидыНастроек.ВидПроцессаДляЗаполненияВЗ];
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Назначение)Тогда
		Назначение = НастройкиАвтозаполнения[ВидыНастроек.НазначениеДляЗаполненияВЗ];
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Продукт) Тогда
		Продукт = НастройкиАвтозаполнения[ВидыНастроек.ПродуктДляЗаполненияВЗ];
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Назначена) Тогда
		Назначена = НастройкиАвтозаполнения[ВидыНастроек.НазначенаДляЗаполненияВЗ];
		
		Если НЕ Назначена.Пустая() Тогда
			Филиал = ОбщегоНазначенияВызовСервера.ФилиалПользователя(Назначена);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
